Revit 2026 API

# RebarSpliceRules Properties

---

The RebarSpliceRules type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaximumBarLength | Identifies the maximum bar length. The default value is 12 meters if the document units are in Metric System, or 40 feet if the units are in Imperial System. |
|  | MinimumBarLength | Identifies the minimum bar length. The default value is 1 meter if the document units are in Metric System, or 3 feet if the units are in Imperial System. |
|  | RunOutPosition | Identifies the run-out position. The default value is RebarSpliceByRulesRunOutPosition.End. |

#### Reference

RebarSpliceRules Class

Autodesk.Revit.DB.Structure Namespace